tests/k6/results/roadmap/before-optimization/roadmap-progress-summary.txt

         /\      Grafana   /ΓÇ╛ΓÇ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ΓÇ╛ΓÇ╛\ 
  /          \   |   (  |  (ΓÇ╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/performance/k6/roadmap/roadmap-progress.test.js
        output: -

     scenarios: (100.00%) 1 scenario, 3 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 3 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 3 VUs  00.3s/30s

running (0m02.0s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [   4% ] 3 VUs  01.3s/30s

running (0m03.0s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [   8% ] 3 VUs  02.3s/30s

running (0m04.0s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [  11% ] 3 VUs  03.3s/30s

running (0m05.0s), 3/3 VUs, 12 complete and 0 interrupted iterations
default   [  14% ] 3 VUs  04.3s/30s

running (0m06.0s), 3/3 VUs, 15 complete and 0 interrupted iterations
default   [  18% ] 3 VUs  05.3s/30s

running (0m07.0s), 3/3 VUs, 18 complete and 0 interrupted iterations
default   [  21% ] 3 VUs  06.3s/30s

running (0m08.0s), 3/3 VUs, 21 complete and 0 interrupted iterations
default   [  24% ] 3 VUs  07.3s/30s

running (0m09.0s), 3/3 VUs, 24 complete and 0 interrupted iterations
default   [  28% ] 3 VUs  08.3s/30s

running (0m10.0s), 3/3 VUs, 27 complete and 0 interrupted iterations
default   [  31% ] 3 VUs  09.3s/30s

running (0m11.0s), 3/3 VUs, 30 complete and 0 interrupted iterations
default   [  34% ] 3 VUs  10.3s/30s

running (0m12.0s), 3/3 VUs, 33 complete and 0 interrupted iterations
default   [  38% ] 3 VUs  11.3s/30s

running (0m13.0s), 3/3 VUs, 36 complete and 0 interrupted iterations
default   [  41% ] 3 VUs  12.3s/30s

running (0m14.0s), 3/3 VUs, 39 complete and 0 interrupted iterations
default   [  44% ] 3 VUs  13.3s/30s

running (0m15.0s), 3/3 VUs, 39 complete and 0 interrupted iterations
default   [  48% ] 3 VUs  14.3s/30s

running (0m16.0s), 3/3 VUs, 42 complete and 0 interrupted iterations
default   [  51% ] 3 VUs  15.3s/30s

running (0m17.0s), 3/3 VUs, 45 complete and 0 interrupted iterations
default   [  54% ] 3 VUs  16.3s/30s

running (0m18.0s), 3/3 VUs, 48 complete and 0 interrupted iterations
default   [  58% ] 3 VUs  17.3s/30s

running (0m19.0s), 3/3 VUs, 51 complete and 0 interrupted iterations
default   [  61% ] 3 VUs  18.3s/30s

running (0m20.0s), 3/3 VUs, 54 complete and 0 interrupted iterations
default   [  64% ] 3 VUs  19.3s/30s

running (0m21.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
default   [  68% ] 3 VUs  20.3s/30s

running (0m22.0s), 3/3 VUs, 60 complete and 0 interrupted iterations
default   [  71% ] 3 VUs  21.3s/30s

running (0m23.0s), 3/3 VUs, 63 complete and 0 interrupted iterations
default   [  74% ] 3 VUs  22.3s/30s

running (0m24.0s), 3/3 VUs, 66 complete and 0 interrupted iterations
default   [  78% ] 3 VUs  23.3s/30s

running (0m25.0s), 3/3 VUs, 69 complete and 0 interrupted iterations
default   [  81% ] 3 VUs  24.3s/30s

running (0m26.0s), 3/3 VUs, 72 complete and 0 interrupted iterations
default   [  84% ] 3 VUs  25.3s/30s

running (0m27.0s), 3/3 VUs, 75 complete and 0 interrupted iterations
default   [  88% ] 3 VUs  26.3s/30s

running (0m28.0s), 3/3 VUs, 78 complete and 0 interrupted iterations
default   [  91% ] 3 VUs  27.3s/30s

running (0m29.0s), 3/3 VUs, 81 complete and 0 interrupted iterations
default   [  94% ] 3 VUs  28.3s/30s

running (0m30.0s), 3/3 VUs, 84 complete and 0 interrupted iterations
default   [  98% ] 3 VUs  29.3s/30s

running (0m31.0s), 3/3 VUs, 87 complete and 0 interrupted iterations
default Γåô [ 100% ] 3 VUs  30s


  Γûê THRESHOLDS 

    http_req_duration
    Γ£ô 'p(95)<1000' p(95)=12.06ms

    http_req_failed
    Γ£ô 'rate<0.02' rate=0.00%


  Γûê TOTAL RESULTS 

    checks_total.......: 183     5.850277/s
    checks_succeeded...: 100.00% 183 out of 183
    checks_failed......: 0.00%   0 out of 183

    Γ£ô login status is 200
    Γ£ô login returned cookies
    Γ£ô setup graph status is 200
    Γ£ô progress in_progress status is 200
    Γ£ô progress completed status is 200

    HTTP
    http_req_duration..............: avg=12.68ms min=5.08ms med=7.69ms max=650.34ms p(90)=11.29ms p(95)=12.06ms
      { expected_response:true }...: avg=12.68ms min=5.08ms med=7.69ms max=650.34ms p(90)=11.29ms p(95)=12.06ms
    http_req_failed................: 0.00%  0 out of 182
    http_reqs......................: 182    5.818308/s

    EXECUTION
    iteration_duration.............: avg=1.01s   min=1.01s  med=1.01s  max=1.04s    p(90)=1.01s   p(95)=1.03s  
    iterations.....................: 90     2.877185/s
    vus............................: 3      min=3        max=3
    vus_max........................: 3      min=3        max=3

    NETWORK
    data_received..................: 342 kB 11 kB/s
    data_sent......................: 27 kB  872 B/s



running (0m31.3s), 0/3 VUs, 90 complete and 0 interrupted iterations
default Γ£ô [ 100% ] 3 VUs  30s